src/Catalogs/ЭкземплярыКомплектующихИзделийКорабля/ЭкземплярыКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭкземплярыКомплектующихИзделийКорабля</name>
  <owners>Catalog.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</owners>
  <attributes>
    <name>СудовойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетныйНомер</name>
    <comment>Учетный номер изделия по справочнику Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПозиции</name>
    <comment>Номер позиции на чертеже системы</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <comment>Помещение, в котором установлен экземпляр комплектующего изделия</comment>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовления</name>
    <comment>Дата изготовления комплектующего изделия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВвода</name>
    <comment>Дата ввода в эксплуатацию</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабль</name>
    <comment>для связи при отборах</comment>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля/ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля</name>
  <comment>История технического обслуживания и ремонта экземпляров комплектующих изделий корабля</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТрудоемкостьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудоемкостьСопутствующихРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительРабот</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Экземпляр</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НаработкаЭкземляровКомплектующихИзделийКорабля/НаработкаЭкземляровКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаработкаЭкземляровКомплектующихИзделийКорабля</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеСНачалаЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Экземпляр</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУчета</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоЦикла</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СвязанныеИзделияЭкземпляровКомплектующихИзделийКорабля/СвязанныеИзделияЭкземпляровКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанныеИзделияЭкземпляровКомплектующихИзделийКорабля</name>
  <resources>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.ВидыСвязейКомплектующихИзделийКорабля</types>
    </type>
  </resources>
  <dimensions>
    <name>Экземпляр</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанноеИзделие</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ЭкземплярыКомплектующихИзделийКорабля/ObjectModule.bsl
// ++ 18.07.2018 11:47:54 Базунов Д.А. Задача: 
Процедура ПередУдалением(Отказ)
	
	НаборЗаписей = РегистрыСведений.ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Экземпляр.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.НаработкаЭкземляровКомплектующихИзделийКорабля.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Экземпляр.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.СвязанныеИзделияЭкземпляровКомплектующихИзделийКорабля.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Экземпляр.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
// -- 18.07.2018 11:47:54 Базунов Д.А. Задача:
